renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/cmd/r_ble_cmd_abs.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2019-2022 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
#include <string.h>
#include <stdlib.h>
#include "r_ble_rx23w_if.h"
#include "r_ble_rx23w_config.h"

#include "abs/r_ble_abs_api.h"
#include "cmd/r_ble_cmd.h"
#include "sec_data/r_ble_sec_data.h"
#include "r_ble_cmd_abs.h"

#if (BLE_CFG_CMD_LINE_EN == 1) && (BLE_CFG_HCI_MODE_EN == 0)

#define BLE_LOG_TAG "abs_cmd"
#include "logger/r_ble_logger.h"

#define pf R_BLE_CLI_Printf

#define BLE_CMD_ADV_OWN_ADDR_TYPE_STR   (10)
#define BLE_CMD_ADV_TYPE_STR            (10)

static void exec_abs_adv(int argc, char *argv[]);
static void exec_abs_scan(int argc, char *argv[]);
static void exec_abs_set_priv(int argc, char *argv[]);
static void exec_abs_conn(int argc, char *argv[]);
static void abort_abs_conn(void);
static void exec_abs_auth(int argc, char *argv[]);
static void abort_abs_scan(void);
static void exec_abs_sync(int argc, char *argv[]);
static void abort_abs_sync(void);
static void exec_abs_disconn(int argc, char *argv[]);
static void exec_abs_device(int argc, char *argv[]);
static void exec_abs_white(int argc, char *argv[]);
static void exec_abs_conn_cfg(int argc, char *argv[]);
static void exec_abs_ver(int argc, char *argv[]);
#if (BLE_CFG_LIB_TYPE == 0) 
static void delete_sync_hdl(st_ble_evt_data_t * p_data);
#endif /* (BLE_CFG_LIB_TYPE == 0) */

static char gs_adv_own_addr_type[BLE_CMD_ADV_OWN_ADDR_TYPE_STR];
static char gs_adv_type[BLE_CMD_ADV_TYPE_STR];
static uint8_t gs_adv_wl;

static uint8_t gs_adv_data[] =
{
    0x02, 0x01,
    (BLE_GAP_AD_FLAGS_LE_GEN_DISC_MODE | BLE_GAP_AD_FLAGS_BR_EDR_NOT_SUPPORTED), 
    0x09, 0x09, 'R', 'B', 'L', 'E', '-', 'D', 'E', 'V', 
};

static uint8_t gs_sres_data[] =
{
    0x09, 0x09, 'R', 'B', 'L', 'E', '-', 'D', 'E', 'V', 
};

typedef struct
{
    uint16_t conn_hdl;
    st_ble_dev_addr_t addr;
} st_device_info_t;

static st_device_info_t connected_device_info[BLE_CFG_RF_CONN_MAX];

#if (BLE_CFG_ABS_API_EN != 0)
extern st_ble_dev_addr_t g_ble_priv_dummy_addr;
extern st_ble_gap_rslv_list_key_set_t g_ble_peer_dummy_irk;
#else /* (BLE_CFG_ABS_API_EN != 0) */
st_ble_dev_addr_t g_ble_priv_dummy_addr;
st_ble_gap_rslv_list_key_set_t g_ble_peer_dummy_irk;
#endif /* (BLE_CFG_ABS_API_EN != 0) */

static st_ble_abs_legacy_adv_param_t gs_legacy_adv_param =
{
    .p_addr                    = NULL,
    .p_adv_data                = gs_adv_data,
    .p_sres_data               = gs_sres_data,
    .fast_adv_intv             = 0x00000100,
    .slow_adv_intv             = 0x00000200,
    .fast_period               = 0x0100,
    .slow_period               = 0x0000,
    .adv_data_length           = sizeof(gs_adv_data),
    .sres_data_length          = sizeof(gs_sres_data),
    .adv_ch_map                = BLE_GAP_ADV_CH_ALL,
    .filter                    = BLE_ABS_ADV_ALLOW_CONN_ANY,
    .o_addr_type               = BLE_GAP_ADDR_RAND,
};

#if (BLE_CFG_LIB_TYPE == 0)
static st_ble_abs_ext_adv_param_t gs_ext_adv_param =
{
    .p_addr                    = NULL,
    .p_adv_data                = gs_adv_data,
    .fast_adv_intv             = 0x00000100,
    .slow_adv_intv             = 0x00000200,
    .fast_period               = 0x0300,
    .slow_period               = 0x0000,
    .adv_data_length           = sizeof(gs_adv_data),
    .adv_ch_map                = BLE_GAP_ADV_CH_ALL,
    .filter                    = BLE_ABS_ADV_ALLOW_CONN_ANY,
    .o_addr_type               = BLE_GAP_ADDR_RAND,
    .adv_phy                   = BLE_GAP_ADV_PHY_1M,
    .sec_adv_phy               = BLE_GAP_ADV_PHY_1M,
};
#endif /* (BLE_CFG_LIB_TYPE == 0) */

static st_ble_abs_non_conn_adv_param_t gs_non_conn_adv_param =
{
    .p_addr                    = NULL,
    .p_adv_data                = gs_adv_data,
    .adv_intv                  = 0x000000a0,
    .duration                  = 0x0000,
    .adv_data_length           = sizeof(gs_adv_data),
    .adv_ch_map                = BLE_GAP_ADV_CH_ALL,
    .o_addr_type               = BLE_GAP_ADDR_RAND,
    .adv_phy                   = BLE_GAP_ADV_PHY_1M,
    .sec_adv_phy               = BLE_GAP_ADV_PHY_1M,
};

#if (BLE_CFG_LIB_TYPE == 0)
static st_ble_abs_perd_adv_param_t gs_periodic_adv_param =
{
    .p_perd_adv_data           = gs_adv_data,
    .perd_intv                 = 0x0040,
    .perd_adv_data_length      = sizeof(gs_adv_data),
};
#endif /* (BLE_CFG_LIB_TYPE == 0) */

#if (BLE_CFG_LIB_TYPE != 2) 
static st_ble_abs_scan_phy_param_t gs_phy_param_1M =
{
    .fast_intv                 = 0x0200,
    .slow_intv                 = 0x0800,
    .fast_window               = 0x0100,
    .slow_window               = 0x0100,
    .scan_type                 = BLE_GAP_SCAN_PASSIVE,
};

#if (BLE_CFG_LIB_TYPE == 0) 
static st_ble_abs_scan_phy_param_t gs_phy_param_sync =
{
    .fast_intv                 = 0x0100,
    .slow_intv                 = 0x0100,
    .fast_window               = 0x0100,
    .slow_window               = 0x0100,
    .scan_type                 = BLE_GAP_SCAN_PASSIVE,
};
