renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/cmd/r_ble_cmd_abs.c
#endif /* (BLE_CFG_LIB_TYPE == 0) */

static uint8_t gs_filt_data[31];

static st_ble_abs_scan_param_t gs_scan_param =
{
    .p_phy_param_1M            = &gs_phy_param_1M,
    .p_phy_param_coded         = NULL,
    .p_filter_data             = gs_filt_data,
    .fast_period               = 0x0100,
    .slow_period               = 0x0000,
    .filter_data_length        = 0,
    .dev_filter                = BLE_ABS_SCAN_ALL_STATIC,
    .filter_dups               = BLE_GAP_SCAN_FILT_DUPLIC_DISABLE,
};

#if (BLE_CFG_LIB_TYPE == 0) 
static st_ble_abs_scan_param_t gs_sync_scan_param =
{
    .p_phy_param_1M            = &gs_phy_param_sync,
    .p_phy_param_coded         = NULL,
    .p_filter_data             = NULL,
    .fast_period               = 0x0000,
    .slow_period               = 0x0000,
    .filter_data_length        = 0,
    .dev_filter                = BLE_ABS_SCAN_WLST_STATIC,
    .filter_dups               = BLE_GAP_SCAN_FILT_DUPLIC_DISABLE,
};
#endif /* (BLE_CFG_LIB_TYPE == 0) */

static st_ble_abs_conn_phy_param_t gs_conn_phy_1m =
{
    .conn_intv                 = 0x00A0,
    .conn_latency              = 0x0000,
    .sup_to                    = 0x03E8,
};

static st_ble_dev_addr_t gs_conn_bd_addr;

static st_ble_abs_conn_param_t gs_conn_param =
{
    .filter                    = BLE_ABS_CONN_USE_ADDR_STATIC,
    .conn_to                   = 7,
    .p_conn_1M                 = &gs_conn_phy_1m,
    .p_conn_2M                 = NULL,
    .p_conn_coded              = NULL,
    .p_addr                    = &gs_conn_bd_addr,
};

#endif /* (BLE_CFG_LIB_TYPE != 2) */

static uint16_t gs_pairing_conn_hdl = BLE_GAP_INVALID_CONN_HDL;
static uint8_t gs_version_proc = 0x00;

#if (BLE_CFG_LIB_TYPE == 0) 
static uint8_t gs_sync_scan = 0;
static st_ble_dev_addr_t gs_sync_advr;
static uint8_t gs_adv_sid;
static uint32_t gs_sync_hdl = 0xFFFFFFFF;
static uint8_t gs_sync_term = 0;
#endif /* (BLE_CFG_LIB_TYPE == 0) */

static const st_ble_cli_cmd_t abs_adv_cmd =
{
    .p_name = "adv",
    .exec   = exec_abs_adv,
    .p_help = "Usage: gap adv (legacy|ext|non-conn|periodic) (start|stop)\n"
                "Start or stop advertising.",
};

static const st_ble_cli_cmd_t abs_scan_cmd =
{
    .p_name = "scan",
    .exec   = exec_abs_scan,
    .abort  = abort_abs_scan,
    .p_help = "Usage: Start : gap scan start\n"
            "Stop : Ctrl-C.",
};

static const st_ble_cli_cmd_t abs_conn_cmd =
{
    .p_name = "conn",
    .exec   = exec_abs_conn,
    .abort  = abort_abs_conn,
    .p_help = "Usage: gap conn {addr}\n"
            "Create connection.",
};

static const st_ble_cli_cmd_t abs_priv_cmd =
{
    .p_name = "priv",
    .exec   = exec_abs_set_priv,
    .p_help = "Usage: gap priv {irk} {privacy_mode}\n"
            "Set local device privacy.",
};

static const st_ble_cli_cmd_t abs_auth_cmd =
{
    .p_name = "auth",
    .exec   = exec_abs_auth,
    .p_help = "Usage: gap auth (start|passkey|numcmp) {conn_hdl|passkey|yes}\n"
            "Start pairing or encryption. or Reply passkey entry or numeric comparison",
};

static const st_ble_cli_cmd_t gap_white_cmd =
{
    .p_name = "wl",
    .exec   = exec_abs_white,
    .p_help = "Usage: gap wl (reg|del|clear)\n"
              "Register or delete or clear white list.",
};

static const st_ble_cli_cmd_t gap_sync_cmd =
{
    .p_name = "sync",
    .exec   = exec_abs_sync,
    .abort  = abort_abs_sync,
    .p_help = "Usage: gap sync create | term  \n"
              "Start sync establishment | terminate sync. ",
};

static const st_ble_cli_cmd_t gap_conn_cfg_cmd =
{
    .p_name = "conn_cfg",
    .exec   = exec_abs_conn_cfg,
    .p_help = "Usage: gap conn_cfg (update|data_len|phy|def_phy) \n"
              "Update connection parameters | Set packet data length | Set PHY | Set Default PHY",
};

static const st_ble_cli_cmd_t gap_disconn_cmd =
{
    .p_name = "disconn",
    .exec   = exec_abs_disconn,
    .p_help = "Usage: gap disconn conn_hdl\n"
              "Disconnect a connection",
};

static const st_ble_cli_cmd_t gap_device_cmd =
{
    .p_name = "device",
    .exec   = exec_abs_device,
    .p_help = "Usage: gap device\n"
              "List connecting devices",
};

static const st_ble_cli_cmd_t gap_version_cmd =
{
    .p_name = "ver",
    .exec   = exec_abs_ver,
    .p_help = "Usage: gap ver\n"
              "Get LL/HCI, Host, lib, BLE FIT module version.",
};

static const st_ble_cli_cmd_t * const abs_sub_cmds[] =
{
    &abs_adv_cmd,
    &abs_scan_cmd,
    &abs_conn_cmd,
    &abs_priv_cmd,
    &abs_auth_cmd,
    &gap_device_cmd,
    &gap_disconn_cmd,
    &gap_sync_cmd,
    &gap_white_cmd,
    &gap_conn_cfg_cmd,
    &gap_version_cmd
};

const st_ble_cli_cmd_t g_abs_cmd =
{
    .p_name      = "gap",
    .p_cmds      = abs_sub_cmds,
    .num_of_cmds = ARRAY_SIZE(abs_sub_cmds),
    .p_help     = "Sub Command: adv, scan, conn, disconn, sync, wl, device, priv, auth, ver\n"
                  "Try 'gap subcmd help' for more information",
};

const st_ble_cli_cmd_t * const abs_cmd[] = {
    &g_abs_cmd,
};

#if (BLE_CFG_LIB_TYPE == 0)
static uint8_t gs_adv_cmd_status;
#endif /* (BLE_CFG_LIB_TYPE == 0) */

/*----------------------------------------------------------------------------------------------------------------------
    adv command
----------------------------------------------------------------------------------------------------------------------*/
static ble_status_t set_adv_addr_type(st_ble_dev_addr_t ** pp_addr, st_ble_dev_addr_t * o_rnd_addr, uint8_t * o_addr_type, uint8_t * o_addr)
{
    ble_status_t ret;
#if (BLE_CFG_LIB_TYPE == 0)
    (void)&o_rnd_addr;
#endif /* (BLE_CFG_LIB_TYPE == 0) */

    ret = BLE_SUCCESS;

    if(strcmp(gs_adv_own_addr_type, "rnd") == 0)
    {
        * o_addr_type = BLE_GAP_ADDR_RAND;
        * pp_addr = NULL;
#if (BLE_CFG_LIB_TYPE == 0)
        memcpy(o_addr, o_rnd_addr->addr, BLE_BD_ADDR_LEN);
#endif /* (BLE_CFG_LIB_TYPE == 0) */
    }
    else if(strcmp(gs_adv_own_addr_type, "rpa_pub") == 0)
    {
        * o_addr_type = BLE_GAP_ADDR_RPA_ID_PUBLIC;
        * pp_addr = &g_ble_priv_dummy_addr;
        memset(o_addr, 0x00, BLE_BD_ADDR_LEN);
    }
    else if(strcmp(gs_adv_own_addr_type, "rpa_rnd") == 0)
    {
        * o_addr_type = BLE_GAP_ADDR_RPA_ID_RANDOM;
        * pp_addr = &g_ble_priv_dummy_addr;
#if (BLE_CFG_LIB_TYPE == 0)
        memcpy(o_addr, o_rnd_addr->addr, BLE_BD_ADDR_LEN);
#endif /* (BLE_CFG_LIB_TYPE == 0) */
    }
    else if(strcmp(gs_adv_own_addr_type, "pub") == 0)
    {
        * o_addr_type = BLE_GAP_ADDR_PUBLIC;
        * pp_addr = NULL;
        memset(o_addr, 0x00, BLE_BD_ADDR_LEN);
    }
    else
    {
        ret = BLE_ERR_INVALID_ARG;
    }

    return ret;
}

void start_adv_cmd(st_ble_dev_addr_t * o_rnd_addr)
{
    ble_status_t ret;

    ret = BLE_SUCCESS;

#if (BLE_CFG_LIB_TYPE == 0)
    if(0 == gs_adv_cmd_status)
    {
        return;
    }
#endif /* (BLE_CFG_LIB_TYPE == 0) */
   
    if(strcmp(gs_adv_type, "legacy") == 0)
    {
        gs_legacy_adv_param.filter = (0 == gs_adv_wl) ? BLE_ABS_ADV_ALLOW_CONN_ANY : BLE_ABS_ADV_ALLOW_CONN_WLST;
        ret = set_adv_addr_type(&gs_legacy_adv_param.p_addr, o_rnd_addr, &gs_legacy_adv_param.o_addr_type, gs_legacy_adv_param.o_addr);
        if(BLE_SUCCESS == ret)
        {
            ret = R_BLE_ABS_StartLegacyAdv(&gs_legacy_adv_param);
        }
    }
    else if(strcmp(gs_adv_type, "ext") == 0)
    {
#if (BLE_CFG_LIB_TYPE == 0)
        gs_ext_adv_param.filter = (0 == gs_adv_wl) ? BLE_ABS_ADV_ALLOW_CONN_ANY : BLE_ABS_ADV_ALLOW_CONN_WLST;
        ret = set_adv_addr_type(&gs_ext_adv_param.p_addr, o_rnd_addr, &gs_ext_adv_param.o_addr_type, gs_ext_adv_param.o_addr);
        if(BLE_SUCCESS == ret)
        {
            ret = R_BLE_ABS_StartExtAdv(&gs_ext_adv_param);
        }
#else /* (BLE_CFG_LIB_TYPE == 0) */
        ret = BLE_ERR_UNSUPPORTED;
#endif /* (BLE_CFG_LIB_TYPE == 0) */
    }
    else if(strcmp(gs_adv_type, "non-conn") == 0)
    {
        gs_non_conn_adv_param.adv_intv = 0x00000180;
        ret = set_adv_addr_type(&gs_non_conn_adv_param.p_addr, o_rnd_addr, &gs_non_conn_adv_param.o_addr_type, gs_non_conn_adv_param.o_addr);
        if(BLE_SUCCESS == ret)
        {
            ret = R_BLE_ABS_StartNonConnAdv(&gs_non_conn_adv_param);
        }
    }
    else if(strcmp(gs_adv_type, "periodic") == 0)
    {
#if (BLE_CFG_LIB_TYPE == 0)
        gs_non_conn_adv_param.adv_intv = 0x00000100;
        gs_non_conn_adv_param.adv_data_length = 0;
        gs_periodic_adv_param.param = gs_non_conn_adv_param;
        ret = set_adv_addr_type(&gs_periodic_adv_param.param.p_addr, o_rnd_addr, &gs_periodic_adv_param.param.o_addr_type, gs_periodic_adv_param.param.o_addr);
        if(BLE_SUCCESS == ret)
        {
            ret = R_BLE_ABS_StartPerdAdv(&gs_periodic_adv_param);
        }
#else /* (BLE_CFG_LIB_TYPE == 0) */
        ret = BLE_ERR_UNSUPPORTED;
#endif /* (BLE_CFG_LIB_TYPE == 0) */
    }
    else
    {
        R_BLE_CLI_PrintUnrecognized();
    }

    if(BLE_SUCCESS != ret)
    {
        R_BLE_CLI_PrintError(ret);
    }

    gs_adv_wl = 0;

#if (BLE_CFG_LIB_TYPE == 0)
    gs_adv_cmd_status = 0;
#endif /* (BLE_CFG_LIB_TYPE == 0) */

