renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/cmd/r_ble_cmd_abs.c
}

static void exec_abs_adv(int argc, char *argv[])
{
    ble_status_t ret;
    
    if ((3 > argc) || (5 < argc))
    {
        R_BLE_CLI_PrintUnrecognized();
        return;
    }

    ret = BLE_SUCCESS;

    if (strcmp(argv[2], "start") == 0)
    {
        strncpy(gs_adv_type, (const char*)argv[1], sizeof(gs_adv_type));

#if (BLE_CFG_LIB_TYPE == 0)
        gs_adv_cmd_status = 1;
#endif /* (BLE_CFG_LIB_TYPE == 0) */

        if (strcmp(argv[argc-1], "-wl") == 0)
        {
            if((strcmp(argv[1], "non-conn") == 0) || (strcmp(argv[1], "periodic") == 0))
            {
                R_BLE_CLI_PrintUnrecognized();
                return;
            }
            else
            {
                gs_adv_wl = 1;
            }
        }

        if((3 == argc) || ((4 == argc) && (1 == gs_adv_wl)))
        {
            strncpy(gs_adv_own_addr_type, "rnd", sizeof(gs_adv_own_addr_type));
        }
        else
        {
            strncpy(gs_adv_own_addr_type, (const char*)argv[3], sizeof(gs_adv_own_addr_type));
        }
#if (BLE_CFG_LIB_TYPE == 0)
        if((strcmp(gs_adv_own_addr_type, "rnd") == 0) || (strcmp(gs_adv_own_addr_type, "rpa_rnd") == 0))
        {
            ret = R_BLE_VS_GetBdAddr(BLE_VS_ADDR_AREA_REG, BLE_GAP_ADDR_RAND);
            if(BLE_SUCCESS != ret)
            {
                gs_adv_cmd_status = 0;
                gs_adv_wl = 0;
                R_BLE_CLI_PrintError(ret);
            }

            return;
        }
        else
        {
            if((strcmp(gs_adv_own_addr_type, "pub") != 0) && (strcmp(gs_adv_own_addr_type, "rpa_pub") != 0))
            {
                gs_adv_cmd_status = 0;
                gs_adv_wl = 0;
                R_BLE_CLI_PrintUnrecognized();
                return;
            }
        }
#else /* (BLE_CFG_LIB_TYPE == 0) */
        if((strcmp(gs_adv_own_addr_type, "pub") != 0) && 
            (strcmp(gs_adv_own_addr_type, "rnd") != 0) &&
            (strcmp(gs_adv_own_addr_type, "rpa_pub") != 0) &&
            (strcmp(gs_adv_own_addr_type, "rpa_rnd") != 0))
        {
            R_BLE_CLI_PrintUnrecognized();
            gs_adv_wl = 0;
            return;
        }
#endif /* (BLE_CFG_LIB_TYPE == 0) */

        start_adv_cmd(NULL);
    }
    else
    {
        uint8_t adv_hdl = 0xFF;
        if(strcmp(argv[1], "legacy") == 0)
        {
            adv_hdl = 0x00;
        }
        else if(strcmp(argv[1], "ext") == 0)
        {
            adv_hdl = 0x01;
        }
        else if(strcmp(argv[1], "non-conn") == 0)
        {
            adv_hdl = 0x02;
        }
        else if(strcmp(argv[1], "periodic") == 0)
        {
            adv_hdl = 0x03;
        }
        else 
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

        if (strcmp(argv[2], "stop") == 0)
        {
            ret = R_BLE_GAP_StopAdv(adv_hdl);
        }
        else if (strcmp(argv[2], "remove") == 0)
        {
            ret = R_BLE_GAP_RemoveAdvSet(BLE_GAP_RMV_ADV_SET_REM_OP, adv_hdl);
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
        }
    }

    if(BLE_SUCCESS != ret)
    {
        R_BLE_CLI_PrintError(ret);
    }

}

/*----------------------------------------------------------------------------------------------------------------------
    scan command
----------------------------------------------------------------------------------------------------------------------*/
#if (BLE_CFG_LIB_TYPE != 2) 
static uint8_t check_scan_addr_type(char* argv)
{
    uint8_t scan_addr = 0xFF;
    if (strcmp(argv, "pub") == 0)
    {
        scan_addr = BLE_GAP_ADDR_PUBLIC;
    }
    else if (strcmp(argv, "rnd") == 0)
    {
        scan_addr = BLE_GAP_ADDR_RAND;
    }
    else if (strcmp(argv, "rpa_pub") == 0)
    {
        scan_addr = BLE_GAP_ADDR_RPA_ID_PUBLIC;
    }
    else if (strcmp(argv, "rpa_rnd") == 0)
    {
        scan_addr = BLE_GAP_ADDR_RPA_ID_RANDOM;
    }
    return scan_addr;
}
#endif /* (BLE_CFG_LIB_TYPE != 2) */

static void exec_abs_scan(int argc, char *argv[])
{
#if (BLE_CFG_LIB_TYPE == 2) 
    R_BLE_CLI_PrintError(BLE_ERR_UNSUPPORTED);
#else /* (BLE_CFG_LIB_TYPE == 2) */
    ble_status_t ret;
    uint8_t scan_wl;
    uint8_t scan_addr;

    if((argc == 2) && (strcmp(argv[1], "stop") == 0))
    {
        R_BLE_CLI_SetCmdComp();
        ret = R_BLE_GAP_StopScan();
    }
    else
    {
        if (5 < argc)
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

        scan_wl = 0;
        if (strcmp(argv[argc-1], "-wl") == 0)
        {
            scan_wl = 1;
        }

        scan_addr = 0xFF;

        gs_scan_param.filter_data_length = 0;
        if (1 < argc)
        {
            scan_addr = check_scan_addr_type(argv[1]);
            if(scan_addr == 0xFF)
            {
                if( (scan_wl == 0) && (argc == 2) )
                {
                    R_BLE_CLI_PrintUnrecognized();
                    return;
                }
                else if( argc >= 3 )
                {
                    uint16_t len;
                    gs_scan_param.filter_ad_type = (uint8_t)strtol(argv[1], NULL, 0);
                    R_BLE_CMD_ParseValues(argv[2], gs_filt_data, &len);
                    if(len == 0)
                    {
                        R_BLE_CLI_PrintUnrecognized();
                        return;
                    }
                    else
                    {
                        gs_scan_param.filter_data_length = len;
                    }
                }
            }
            else
            {
                if (3 < argc)
                {
                    R_BLE_CLI_PrintUnrecognized();
                    return;
                }
                else if( (argc == 3) && (scan_wl != 1) )
                {
                    R_BLE_CLI_PrintUnrecognized();
                    return;
                }
            }
        }
        if (3 < argc)
        {
            scan_addr = check_scan_addr_type(argv[3]);
            if(scan_addr == 0xFF)
            {
                if( (scan_wl == 1) && (argc != 4) )
                {
                    R_BLE_CLI_PrintUnrecognized();
                    return;
                }
            }
            else
            {
                if( (scan_wl == 1) && (argc != 5) )
                {
                    R_BLE_CLI_PrintUnrecognized();
                    return;
                }
            }
        }

        if(0xFF == scan_addr)
        {
            gs_phy_param_1M.scan_type = BLE_GAP_SCAN_PASSIVE;
            scan_addr = BLE_GAP_ADDR_RAND;
        }
        else
        {
            gs_phy_param_1M.scan_type = BLE_GAP_SCAN_ACTIVE;
        }

        gs_scan_param.dev_filter = (0 == scan_wl) ? 
                    (BLE_GAP_SCAN_ALLOW_ADV_ALL  | (scan_addr << 4)) : 
                    (BLE_GAP_SCAN_ALLOW_ADV_WLST | (scan_addr << 4));

#if (BLE_CFG_LIB_TYPE == 0) 
        gs_sync_scan = 0;
#endif /* (BLE_CFG_LIB_TYPE == 0) */
        ret = R_BLE_ABS_StartScan(&gs_scan_param);
    }

    if(BLE_SUCCESS != ret)
    {
        R_BLE_CLI_PrintError(ret);
    }
#endif /* (BLE_CFG_LIB_TYPE == 2) */
}

static void abort_abs_scan(void)
{
    R_BLE_GAP_StopScan();
}

/*----------------------------------------------------------------------------------------------------------------------
    conn command
----------------------------------------------------------------------------------------------------------------------*/
#if (BLE_CFG_LIB_TYPE != 2) 
static void abs_conn_set_event(void)
{
    ble_status_t ret;
    ret = R_BLE_ABS_CreateConn(&gs_conn_param);
    if (ret != BLE_SUCCESS)
    {
        R_BLE_CLI_PrintError(ret);
    }
}
#endif /* (BLE_CFG_LIB_TYPE != 2) */

static void exec_abs_conn(int argc, char *argv[])
{
#if (BLE_CFG_LIB_TYPE == 2) 
    R_BLE_CLI_PrintError(BLE_ERR_UNSUPPORTED);
#else /* (BLE_CFG_LIB_TYPE == 2) */
    ble_status_t ret;
    uint8_t set_event_conn;
    uint8_t conn_wl;

    if ((3 > argc) || (6 < argc))
    {
        R_BLE_CLI_PrintUnrecognized();
        return;
    }

    conn_wl = 0;
    if (strcmp(argv[argc-1], "-wl") == 0)
    {
        conn_wl = 1;
    }

    R_BLE_CMD_ParseAddr(argv[1], gs_conn_bd_addr.addr);

    if ((strcmp(argv[2], "pub") == 0) || (strcmp(argv[2], "rpa_pub") == 0))
    {
        gs_conn_bd_addr.type = BLE_GAP_ADDR_PUBLIC;
    }
    else if ((strcmp(argv[2], "rnd") == 0) || (strcmp(argv[2], "rpa_rnd") == 0))
    {
        gs_conn_bd_addr.type = BLE_GAP_ADDR_RAND;
    }
    else
    {
        R_BLE_CLI_PrintUnrecognized();
        return;
    }

    gs_conn_param.filter = BLE_ABS_CONN_USE_ADDR_STATIC;
    set_event_conn = 0;

    if (3 < argc)
    {
        if (strcmp(argv[3], "rpa_pub") == 0)
        {
            gs_conn_param.filter = BLE_ABS_CONN_USE_ADDR_RPA_PUBLIC;
        }
        else if (strcmp(argv[3], "rpa_rnd") == 0)
        {
            gs_conn_param.filter = BLE_ABS_CONN_USE_ADDR_RPA_STATIC;
        }
        else if (strcmp(argv[3], "rnd") == 0)
        {
            gs_conn_param.filter = BLE_ABS_CONN_USE_ADDR_STATIC;
        }
        else if (strcmp(argv[3], "pub") == 0)
        {
            gs_conn_param.filter = BLE_ABS_CONN_USE_ADDR_PUBLIC;
        }
        else if (strcmp(argv[3], "-wl") != 0)
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }
    }

