renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/cmd/r_ble_cmd_abs.c
    if(0 != conn_wl)
    {
        gs_conn_param.filter = gs_conn_param.filter + BLE_GAP_INIT_FILT_USE_WLST;
    }

    if(((5 == argc) && (0 == conn_wl)) ||
       ((6 == argc) && (0 != conn_wl)))
    {
        if(BLE_ABS_CONN_USE_ADDR_RPA_PUBLIC > gs_conn_param.filter)
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

        if (strcmp(argv[4], "dummy_irk") == 0)
        {
            set_event_conn = 1;
            ret = R_BLE_GAP_ConfRslvList(BLE_GAP_LIST_ADD_DEV, &gs_conn_bd_addr, &g_ble_peer_dummy_irk, 1);
            R_BLE_SetEvent(abs_conn_set_event);
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }
    }

    if(0 == set_event_conn)
    {
        ret = R_BLE_ABS_CreateConn(&gs_conn_param);
    }

    if (ret != BLE_SUCCESS)
    {
        R_BLE_CLI_PrintError(ret);
    }
#endif /* (BLE_CFG_LIB_TYPE == 2) */
}

static void abort_abs_conn(void)
{
    R_BLE_GAP_CancelCreateConn();
}

/*----------------------------------------------------------------------------------------------------------------------
    conn_cfg command
----------------------------------------------------------------------------------------------------------------------*/

static void exec_abs_conn_cfg(int argc, char *argv[])
{
    uint16_t conn_hdl;
    ble_status_t ret;

    ret = BLE_SUCCESS;

    if (strcmp(argv[1], "update") == 0)
    {
        st_ble_gap_conn_param_t updt_param;

        if (argc == 6)
        {
            conn_hdl                 = (uint16_t)strtol(argv[2], NULL, 0);
            updt_param.conn_intv_min = (uint16_t)strtol(argv[3], NULL, 0);
            updt_param.conn_intv_max = updt_param.conn_intv_min;
            updt_param.conn_latency  = (uint16_t)strtol(argv[4], NULL, 0);
            updt_param.sup_to        = (uint16_t)strtol(argv[5], NULL, 0);
            updt_param.min_ce_length = 0xFFFF;
            updt_param.max_ce_length = 0xFFFF;

            ret = R_BLE_GAP_UpdConn(conn_hdl, BLE_GAP_CONN_UPD_MODE_REQ, 0x0000, &updt_param);
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
        }
    }
    else if (strcmp(argv[1], "phy") == 0)
    {
#if (BLE_CFG_LIB_TYPE == 2) 
        ret = BLE_ERR_UNSUPPORTED;
#else /* (BLE_CFG_LIB_TYPE == 2) */
        st_ble_gap_set_phy_param_t phy;
        if (argc == 6)
        {
            conn_hdl               = (uint16_t)strtol(argv[2], NULL, 0);
            phy.tx_phys            = (uint8_t)strtol(argv[3], NULL, 0);
            phy.rx_phys            = (uint8_t)strtol(argv[4], NULL, 0);
            phy.phy_options        = (uint8_t)strtol(argv[5], NULL, 0);

            ret = R_BLE_GAP_SetPhy(conn_hdl, &phy);
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
        }
#endif /* (BLE_CFG_LIB_TYPE == 2) */
    }
    else if (strcmp(argv[1], "def_phy") == 0)
    {
#if (BLE_CFG_LIB_TYPE == 2) 
        ret = BLE_ERR_UNSUPPORTED;
#else /* (BLE_CFG_LIB_TYPE == 2) */
        st_ble_gap_set_def_phy_param_t phy;
        if (argc == 4)
        {
            phy.tx_phys            = (uint8_t)strtol(argv[2], NULL, 0);
            phy.rx_phys            = (uint8_t)strtol(argv[3], NULL, 0);

            ret = R_BLE_GAP_SetDefPhy(&phy);
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
        }
#endif /* (BLE_CFG_LIB_TYPE == 2) */
    }
    else if (strcmp(argv[1], "data_len") == 0)
    {
        uint16_t tx_len;
        uint16_t tx_time;
        if (argc == 5)
        {
            conn_hdl           = (uint16_t)strtol(argv[2], NULL, 0);
            tx_len             = (uint16_t)strtol(argv[3], NULL, 0);
            tx_time            = (uint16_t)strtol(argv[4], NULL, 0);

            ret = R_BLE_GAP_SetDataLen(conn_hdl, tx_len, tx_time);
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
        }
    }
    else
    {
        R_BLE_CLI_PrintUnrecognized();
    }

    if(BLE_SUCCESS != ret)
    {
        R_BLE_CLI_PrintError(ret);
    }

}

/*----------------------------------------------------------------------------------------------------------------------
    priv command
----------------------------------------------------------------------------------------------------------------------*/
static void exec_abs_set_priv(int argc, char *argv[])
{
    uint8_t irk[16];
    uint8_t priv;
    char tmp[2];
    ble_status_t ret;
    int32_t i;
    char * p_mode;
    uint8_t * p_irk;
    st_ble_dev_addr_t rem_addr;

    ret = BLE_SUCCESS;

    if (strcmp(argv[1], "set") == 0)
    {
        if (argc == 4)
        {
            if(32 != strlen(argv[2]))
            {
                pf("invalid irk size\n");
                R_BLE_CLI_SetCmdComp();
                return;
            }

            /* WAIT_LOOP */
            for(i=0; i<BLE_GAP_IRK_SIZE; i++)
            {
                memcpy(tmp, argv[2] + i * 2, 2);
                irk[i] = (uint8_t)strtol(tmp, NULL, 16);
            }

            p_mode = argv[3];
            p_irk = irk;
        }
        else if (argc == 3)
        {
            p_mode = argv[2];
            p_irk = NULL;
        }
        else
        {
            R_BLE_CLI_PrintError(BLE_ERR_INVALID_ARG);
            return;
        }

        if (strcmp(p_mode, "net") == 0)
        {
            priv = BLE_ABS_PRIV_NET_STATIC_IDADDR;
        }
        else if (strcmp(p_mode, "dev") == 0)
        {
            priv = BLE_ABS_PRIV_DEV_STATIC_IDADDR;
        }
        else if(strcmp(p_mode, "net_pub") == 0)
        {
            priv = BLE_ABS_PRIV_NET_PUBLIC_IDADDR;
        }
        else if (strcmp(p_mode, "dev_pub") == 0)
        {
            priv = BLE_ABS_PRIV_DEV_PUBLIC_IDADDR;
        }
        else if(strcmp(p_mode, "net_rnd") == 0)
        {
            priv = BLE_ABS_PRIV_NET_STATIC_IDADDR;
        }
        else if (strcmp(p_mode, "dev_rnd") == 0)
        {
            priv = BLE_ABS_PRIV_DEV_STATIC_IDADDR;
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

