renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/cmd/r_ble_cmd_abs.c
        ret = R_BLE_ABS_SetLocPrivacy(p_irk, priv);
    }
    else if (strcmp(argv[1], "remove") == 0)
    {

        if (argc != 4)
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

        R_BLE_CMD_ParseAddr(argv[2], rem_addr.addr);

        if (strcmp(argv[3], "pub") == 0)
        {
            rem_addr.type = BLE_GAP_ADDR_PUBLIC;
        }
        else if (strcmp(argv[3], "rnd") == 0)
        {
            rem_addr.type = BLE_GAP_ADDR_RAND;
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

        ret = R_BLE_GAP_ConfRslvList(BLE_GAP_LIST_REM_DEV, &rem_addr, NULL, 1);
    }
    else if (strcmp(argv[1], "get") == 0)
    {
        /* set dummy address */
        memset(&rem_addr, 0x00, sizeof(st_ble_dev_addr_t));

        if ((argc != 3) && (argc != 5))
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

        if (5 == argc)
        {
            R_BLE_CMD_ParseAddr(argv[3], rem_addr.addr);

            if (strcmp(argv[4], "pub") == 0)
            {
                rem_addr.type = BLE_GAP_ADDR_PUBLIC;
            }
            else if (strcmp(argv[4], "rnd") == 0)
            {
                rem_addr.type = BLE_GAP_ADDR_RAND;
            }
            else
            {
                R_BLE_CLI_PrintUnrecognized();
                return;
            }
        }

        if (strcmp(argv[2], "lrpa") == 0)
        {
            ret = R_BLE_GAP_ReadRpa(&rem_addr);
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }
    }
    else if (strcmp(argv[1], "off") == 0)
    {
        if (argc != 2)
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

        ret = R_BLE_GAP_EnableRpa(0);
    }
    else
    {
        R_BLE_CLI_PrintUnrecognized();
        return;
    }

    if (ret != BLE_SUCCESS)
    {
        R_BLE_CLI_PrintError(ret);
    }

}

/*----------------------------------------------------------------------------------------------------------------------
    white list command
----------------------------------------------------------------------------------------------------------------------*/
static void exec_abs_white(int argc, char *argv[])
{
    ble_status_t ret;

    ret = BLE_SUCCESS;

    if (strcmp(argv[1], "reg") == 0)
    {
        if (argc != 4)
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }
        st_ble_dev_addr_t dev;

        R_BLE_CMD_ParseAddr(argv[2], dev.addr);

        if (strcmp(argv[3], "rnd") == 0)
        {
            dev.type = BLE_GAP_ADDR_RAND;
        }
        else if (strcmp(argv[3], "pub") == 0)
        {
            dev.type = BLE_GAP_ADDR_PUBLIC;
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }
        
        ret = R_BLE_GAP_ConfWhiteList(BLE_GAP_LIST_ADD_DEV, &dev, 1);
    }
    else if (strcmp(argv[1], "del") == 0)
    {
        st_ble_dev_addr_t dev;

        if (argc != 4)
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }
        R_BLE_CMD_ParseAddr(argv[2], dev.addr);

        if (strcmp(argv[3], "rnd") == 0)
        {
            dev.type = BLE_GAP_ADDR_RAND;
        }
        else if (strcmp(argv[3], "pub") == 0)
        {
            dev.type = BLE_GAP_ADDR_PUBLIC;
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

        ret = R_BLE_GAP_ConfWhiteList(BLE_GAP_LIST_REM_DEV, &dev, 1);
    }
    else if (strcmp(argv[1], "clear") == 0)
    {
        ret = R_BLE_GAP_ConfWhiteList(BLE_GAP_LIST_CLR, NULL, 1);
    }
    else
    {
        R_BLE_CLI_PrintUnrecognized();
    }

    if (ret != BLE_SUCCESS)
    {
        R_BLE_CLI_PrintError(ret);
    }
}


/*----------------------------------------------------------------------------------------------------------------------
    periodic sync command
----------------------------------------------------------------------------------------------------------------------*/
#if (BLE_CFG_LIB_TYPE == 0) 
static void abs_sync_set_event(void)
{
    ble_status_t ret;

    gs_sync_scan = 1;
    
    ret = R_BLE_ABS_StartScan(&gs_sync_scan_param);

    if (ret != BLE_SUCCESS)
    {
        R_BLE_CLI_PrintError(ret);
    }
}
#endif /* (BLE_CFG_LIB_TYPE == 0)  */

static void exec_abs_sync(int argc, char *argv[])
{
#if (BLE_CFG_LIB_TYPE == 0) 
    st_ble_dev_addr_t advr;
    ble_status_t ret;

    ret = BLE_SUCCESS;

    if (strcmp(argv[1], "create") == 0)
    {
        if (argc != 4)
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }
        R_BLE_CMD_ParseAddr(argv[2], advr.addr);
        if (strcmp(argv[3], "rnd") == 0)
        {
            advr.type = BLE_GAP_ADDR_RAND;
        }
        else if (strcmp(argv[3], "pub") == 0)
        {
            advr.type = BLE_GAP_ADDR_PUBLIC;
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

        /* white list */
        ret = R_BLE_GAP_ConfWhiteList(BLE_GAP_LIST_ADD_DEV, &advr, 1);

        if(BLE_SUCCESS == ret)
        {
            /* scan */
            R_BLE_SetEvent(abs_sync_set_event);
        }
    }
    else if (strcmp(argv[1], "term") == 0)
    {
        if ((argc != 2) && (argc != 3))
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

        if(argc == 2)
        {
            if(0xFFFF != (uint16_t)gs_sync_hdl)
            {
                ret = R_BLE_GAP_TerminateSync((uint16_t)gs_sync_hdl);
                gs_sync_term = 1;
            }
            else
            {
                if(0xFFFF != (uint16_t)(gs_sync_hdl >> 16))
                {
                    ret = R_BLE_GAP_TerminateSync((uint16_t)(gs_sync_hdl >> 16));
                }
                else
                {
                    ret = BLE_ERR_INVALID_HDL;
                }
            }
        }
        else
        {
            uint16_t sync_hdl;
            sync_hdl = (uint16_t)strtol(argv[2], NULL, 0);
            ret = R_BLE_GAP_TerminateSync(sync_hdl);
        }
    }
    else
    {
        R_BLE_CLI_PrintUnrecognized();
    }

    if (ret != BLE_SUCCESS)
    {
        R_BLE_CLI_PrintError(ret);
    }
#else  /* (BLE_CFG_LIB_TYPE == 0)  */
    R_BLE_CLI_PrintError(BLE_ERR_UNSUPPORTED);
#endif /* (BLE_CFG_LIB_TYPE == 0)  */
}

