renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/cmd/r_ble_cmd_abs.c
static void abort_abs_sync(void)
{
    R_BLE_GAP_CancelCreateSync();
}

#if (BLE_CFG_LIB_TYPE == 0) 
static void delete_sync_hdl(st_ble_evt_data_t * p_data)
{
    st_ble_gap_sync_hdl_evt_t * p_sync_evt;
    uint16_t sync_hdl_1;

    gs_sync_scan = 0;

    p_sync_evt = (st_ble_gap_sync_hdl_evt_t *)p_data->p_param;
    pf("sync_hdl : 0x%04x \n", p_sync_evt->sync_hdl);
    sync_hdl_1 = (uint16_t)(gs_sync_hdl);
    if(sync_hdl_1 == p_sync_evt->sync_hdl)
    {
        gs_sync_hdl |= 0x0000FFFF;
    }
    else
    {
        gs_sync_hdl |= 0xFFFF0000;
    }

}
#endif /* (BLE_CFG_LIB_TYPE == 0) */

/*----------------------------------------------------------------------------------------------------------------------
    gap disconn command
----------------------------------------------------------------------------------------------------------------------*/
static void exec_abs_disconn(int argc, char *argv[])
{
    if (argc != 2)
    {
        R_BLE_CLI_PrintUnrecognized();
        return;
    }

    uint16_t conn_hdl;
    conn_hdl = (uint16_t)strtol(argv[1], NULL, 0);

    ble_status_t ret;
    /* 0x13: Remote User Terminated Connection. */
    ret = R_BLE_GAP_Disconnect(conn_hdl, 0x13);
    if (ret != BLE_SUCCESS)
    {
        R_BLE_CLI_PrintError(ret);
    }
}

/*----------------------------------------------------------------------------------------------------------------------
    gap device command
----------------------------------------------------------------------------------------------------------------------*/
static void exec_abs_device(int argc, char *argv[])
{
    /* WAIT_LOOP */
    for (int i = 0; i < BLE_CFG_RF_CONN_MAX; i++)
    {
        if (connected_device_info[i].conn_hdl != BLE_GAP_INVALID_CONN_HDL)
        {
            pf("conn_hdl=0x%04X, bdaddr=%s\n",
                             connected_device_info[i].conn_hdl,
                             BLE_BD_ADDR_STR(connected_device_info[i].addr.addr,
                                             connected_device_info[i].addr.type));
        }
    }
}

/*----------------------------------------------------------------------------------------------------------------------
    gap ver command
----------------------------------------------------------------------------------------------------------------------*/
static void exec_abs_ver(int argc, char *argv[])
{
    ble_status_t ret;
    ret = R_BLE_GAP_GetVerInfo();
    if (ret != BLE_SUCCESS)
    {
        R_BLE_CLI_PrintError(ret);
        gs_version_proc = 0x00;
    }
    else
    {
        gs_version_proc = 0x01;
    }
}



/*----------------------------------------------------------------------------------------------------------------------
    auth command
----------------------------------------------------------------------------------------------------------------------*/
static void exec_abs_auth(int argc, char *argv[])
{
    uint16_t conn_hdl;
    uint32_t passkey;
    ble_status_t ret = BLE_SUCCESS;
    uint8_t resp;

    if (argc > 6)
    {
        R_BLE_CLI_PrintUnrecognized();
        return;
    }

    if (strcmp(argv[1], "start") == 0)
    {
        conn_hdl = (uint16_t)strtol(argv[2], NULL, 0);
        ret = R_BLE_ABS_StartAuth(conn_hdl);
    }
    else if(strcmp(argv[1], "passkey") == 0)
    {
        if(3 != argc)
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }
        passkey = (uint32_t)strtol(argv[2], NULL, 10);
        ret = R_BLE_GAP_ReplyPasskeyEntry(gs_pairing_conn_hdl, passkey, BLE_GAP_PAIRING_ACCEPT);
    }
    else if(strcmp(argv[1], "numcmp") == 0)
    {
        resp = BLE_GAP_PAIRING_REJECT;
        if(strcmp(argv[2], "yes") == 0)
        {
            resp = BLE_GAP_PAIRING_ACCEPT;
        }

        ret = R_BLE_GAP_ReplyNumComp(gs_pairing_conn_hdl, resp);
    }
    else if(strcmp(argv[1], "del") == 0)
    {
        int32_t local = BLE_GAP_SEC_DEL_LOC_NONE;
        int32_t remote = BLE_GAP_SEC_DEL_REM_NONE;
        ble_gap_del_bond_cb_t cb = NULL;
        st_ble_dev_addr_t rem_dev;

        if(strcmp(argv[2], "local") == 0)
        {
            local = BLE_GAP_SEC_DEL_LOC_ALL;
        }
        else if(strcmp(argv[2], "remote") == 0)
        {
            if(argc > 3)
            {
                if(strcmp(argv[3], "addr") == 0 && (6 == argc))
                {
                    remote = BLE_GAP_SEC_DEL_REM_SA;
                    R_BLE_CMD_ParseAddr(argv[4], rem_dev.addr);

                    if (strcmp(argv[5], "rnd") == 0)
                    {
                        rem_dev.type = BLE_GAP_ADDR_RAND;
                    }
                    else if (strcmp(argv[5], "pub") == 0)
                    {
                        rem_dev.type = BLE_GAP_ADDR_PUBLIC;
                    }
                    else
                    {
                        R_BLE_CLI_PrintUnrecognized();
                        return;
                    }
                }
                else if(strcmp(argv[3], "all") == 0)
                {
                    remote = BLE_GAP_SEC_DEL_REM_ALL;
                }
                else if(strcmp(argv[3], "not_conn") == 0)
                {
                    remote = BLE_GAP_SEC_DEL_REM_NOT_CONN;
                }
                else
                {
                    R_BLE_CLI_PrintUnrecognized();
                    return;
                }
#if (BLE_CFG_EN_SEC_DATA == 1)
                cb = R_BLE_SECD_DelRemKeys;
#endif /* (BLE_CFG_EN_SEC_DATA == 1) */
            }
            else
            {
                R_BLE_CLI_PrintUnrecognized();
                return;
            }
        }
        else if(strcmp(argv[2], "all") == 0)
        {
            local = BLE_GAP_SEC_DEL_LOC_ALL;
            remote = BLE_GAP_SEC_DEL_REM_ALL;
#if (BLE_CFG_EN_SEC_DATA == 1)
            cb = R_BLE_SECD_DelRemKeys;
#endif /* (BLE_CFG_EN_SEC_DATA == 1) */
        }
        else
        {
            R_BLE_CLI_PrintUnrecognized();
            return;
        }

