renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/cmd/r_ble_cmd_abs.c
        R_BLE_GAP_DeleteBondInfo(local, remote, &rem_dev, cb);
#if (BLE_CFG_EN_SEC_DATA == 1)
        if(BLE_GAP_SEC_DEL_LOC_ALL== local)
        {
            R_BLE_SECD_DelLocInfo();
        }
#endif /* (BLE_CFG_EN_SEC_DATA == 1) */

    }
    else
    {
        R_BLE_CLI_PrintUnrecognized();
    }

    if (ret != BLE_SUCCESS)
    {
        R_BLE_CLI_PrintError(ret);
    }
}

void R_BLE_CMD_AbsGapCb(uint16_t type, ble_status_t result, st_ble_evt_data_t * p_data)
{
    (void)result;

    switch (type)
    {
        case BLE_GAP_EVENT_STACK_ON:
        {
            memset(connected_device_info,0xFF,sizeof(connected_device_info));
#if (BLE_CFG_LIB_TYPE == 0)
            gs_adv_cmd_status = 0;
#endif /* (BLE_CFG_LIB_TYPE == 0) */
        } break;

        case BLE_GAP_EVENT_LOC_VER_INFO:
        {
            if(0x01 == gs_version_proc)
            {
                st_ble_gap_loc_dev_info_evt_t * p_ver_evt_param =
                    (st_ble_gap_loc_dev_info_evt_t *)p_data->p_param;
                pf("Link Layer / HCI Version\n");
                pf("HCI version           : 0x%02x\n", p_ver_evt_param->l_bt_info.hci_ver);
                pf("HCI revision          : 0x%04x\n", p_ver_evt_param->l_bt_info.hci_rev);
                pf("Link Layer version    : 0x%02x\n", p_ver_evt_param->l_bt_info.lmp_ver);
                pf("Link Layer subversion : 0x%04x\n", p_ver_evt_param->l_bt_info.lmp_sub_ver);
                pf("Manufacturer ID       : 0x%04x\n", p_ver_evt_param->l_bt_info.mnf_name);
                pf("Host stack Version\n");
                pf("major version         : 0x%02x\n", p_ver_evt_param->l_ver_num.major);
                pf("minor version         : 0x%02x\n", p_ver_evt_param->l_ver_num.minor);
                pf("subminor version      : 0x%02x\n", p_ver_evt_param->l_ver_num.subminor);
                pf("BLE FIT module Version\n");
                pf("major | minor version : 0x%08x\n", R_BLE_GetVersion());
                pf("lib type              : 0x%08x\n", R_BLE_GetLibType());
                gs_version_proc = 0x00;
                R_BLE_CLI_SetCmdComp();
            }
        } break;

        case BLE_GAP_EVENT_ADV_REPT_IND:
        {
            st_ble_gap_adv_rept_evt_t * p_adv_rept_evt_param =
                (st_ble_gap_adv_rept_evt_t *)p_data->p_param;

            switch (p_adv_rept_evt_param->adv_rpt_type)
            {
                case 0x00:
                {
                    st_ble_gap_adv_rept_t * p_adv_rept_param =
                        (st_ble_gap_adv_rept_t *)p_adv_rept_evt_param->param.p_adv_rpt;
                        pf("%s\n", BLE_BD_ADDR_STR(p_adv_rept_param->p_addr, p_adv_rept_param->addr_type));
                } break;

#if (BLE_CFG_LIB_TYPE == 0) 
                case 0x01:
                {
                    st_ble_gap_ext_adv_rept_t * p_ext_adv_rept_param =
                        (st_ble_gap_ext_adv_rept_t *)p_adv_rept_evt_param->param.p_ext_adv_rpt;
                    pf("%s %02x %04x\n", BLE_BD_ADDR_STR(p_ext_adv_rept_param->p_addr, p_ext_adv_rept_param->addr_type), p_ext_adv_rept_param->adv_sid, p_ext_adv_rept_param->perd_adv_intv);

                    if((1 == gs_sync_scan) && (0xFF != p_ext_adv_rept_param->adv_sid) && (0x0000 != p_ext_adv_rept_param->perd_adv_intv))
                    {
                        gs_sync_scan = 2;

                        /* found */
                        memcpy(gs_sync_advr.addr, p_ext_adv_rept_param->p_addr, BLE_BD_ADDR_LEN);
                        gs_sync_advr.type = p_ext_adv_rept_param->addr_type;
                        gs_adv_sid = p_ext_adv_rept_param->adv_sid;
                        R_BLE_GAP_ConfPerdAdvList(BLE_GAP_LIST_ADD_DEV, &gs_sync_advr, &gs_adv_sid, 1);
                    }

                } break;

                case 0x02:
                {
                    st_ble_gap_perd_adv_rept_t * p_perd_adv_rept_param =
                        (st_ble_gap_perd_adv_rept_t *) p_adv_rept_evt_param->param.p_per_adv_rpt;
                    pf("sync_hdl : 0x%04x \n", p_perd_adv_rept_param->sync_hdl);
                } break;
#endif /* (BLE_CFG_LIB_TYPE == 0)  */

                default:
                    break;
            }
        } break;

        case BLE_GAP_EVENT_CONN_IND:
        {
            pf("receive BLE_GAP_EVENT_CONN_IND result : 0x%04x\n", result);
            if (result == BLE_SUCCESS)
            {
                st_ble_gap_conn_evt_t *conn_evt_param = 
                    (st_ble_gap_conn_evt_t *)p_data->p_param;


                int32_t i;

                /* WAIT_LOOP */
                for (i = 0; i < BLE_CFG_RF_CONN_MAX; i++)
                {
                    if (connected_device_info[i].conn_hdl == BLE_GAP_INVALID_CONN_HDL)
                    {
                        break;
                    }
                }

                if(BLE_CFG_RF_CONN_MAX == i)
                {
                    R_BLE_CLI_SetCmdComp();
                    break;
                }

                connected_device_info[i].conn_hdl = conn_evt_param->conn_hdl;
                connected_device_info[i].addr.type = conn_evt_param->remote_addr_type;
                memcpy(connected_device_info[i].addr.addr,
                        conn_evt_param->remote_addr,
                        BLE_BD_ADDR_LEN);

                pf("gap: connected conn_hdl:0x%04X, addr:%s\n",
                   connected_device_info[i].conn_hdl,
                   BLE_BD_ADDR_STR(connected_device_info[i].addr.addr,
                                   connected_device_info[i].addr.type));
            }

            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_CREATE_CONN_COMP:
        {
            if(BLE_SUCCESS != result)
            {
                pf("receive BLE_GAP_EVENT_CREATE_CONN_COMP result : 0x%04x\n", result);
                R_BLE_CLI_SetCmdComp();
            }
        } break;

        case BLE_GAP_EVENT_DISCONN_IND:
        {
            st_ble_gap_disconn_evt_t *disc_evt_param =
                (st_ble_gap_disconn_evt_t *)p_data->p_param;
            pf("receive BLE_GAP_EVENT_DISCONN_IND result : 0x%04x\n", result);

            /* WAIT_LOOP */
            for (int32_t i = 0; i < BLE_CFG_RF_CONN_MAX; i++)
            {
                if (connected_device_info[i].conn_hdl == disc_evt_param->conn_hdl)
                {
                    pf("gap: disconnected conn_hdl:0x%04X, addr:%s, reason:0x%02x\n",
                       connected_device_info[i].conn_hdl,
                       BLE_BD_ADDR_STR(connected_device_info[i].addr.addr,
                                       connected_device_info[i].addr.type),
                       disc_evt_param->reason);

                    connected_device_info[i].conn_hdl = BLE_GAP_INVALID_CONN_HDL;
                    break;
                }
            }
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_SET_DATA_LEN_COMP:
        {
            st_ble_gap_conn_hdl_evt_t * p_data_len = (st_ble_gap_conn_hdl_evt_t *)p_data->p_param;
            pf("receive BLE_GAP_EVENT_SET_DATA_LEN_COMP result : 0x%04x, conn_hdl : 0x%04x\n", result, p_data_len->conn_hdl);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_DATA_LEN_CHG:
        {
            st_ble_gap_data_len_chg_evt_t * p_data_len = (st_ble_gap_data_len_chg_evt_t *)p_data->p_param;
            pf("receive BLE_GAP_EVENT_DATA_LEN_CHG result : 0x%04x, conn_hdl : 0x%04x \n", result, p_data_len->conn_hdl);
            pf("tx_octets : 0x%04x\n", p_data_len->tx_octets);
            pf("tx_time   : 0x%04x\n", p_data_len->tx_time);
            pf("rx_octets : 0x%04x\n", p_data_len->rx_octets);
            pf("rx_time   : 0x%04x\n", p_data_len->rx_time);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_PHY_SET_COMP :
        {
            st_ble_gap_conn_hdl_evt_t * p_phy_comop = (st_ble_gap_conn_hdl_evt_t *)p_data->p_param;
            pf("receive BLE_GAP_EVENT_PHY_SET_COMP result : 0x%04x, conn_hdl : 0x%04x\n", result, p_phy_comop->conn_hdl);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_PHY_UPD:
        {
            st_ble_gap_phy_upd_evt_t * p_phy_up = (st_ble_gap_phy_upd_evt_t *)p_data->p_param;
            pf("receive BLE_GAP_EVENT_PHY_UPD result : 0x%04x, conn_hdl : 0x%04x\n", result, p_phy_up->conn_hdl);
            pf("tx_phy : 0x%04x\n", p_phy_up->tx_phy);
            pf("rx_phy : 0x%04x\n", p_phy_up->rx_phy);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_CONN_PARAM_UPD_COMP:
        {
            st_ble_gap_conn_upd_evt_t * p_conn_up = (st_ble_gap_conn_upd_evt_t *)p_data->p_param;
            pf("receive BLE_GAP_EVENT_CONN_PARAM_UPD_COMP result : 0x%04x, conn_hdl : 0x%04x\n", result, p_conn_up->conn_hdl);
            pf("conn_intv    : 0x%04x\n", p_conn_up->conn_intv);
            pf("conn_latency : 0x%04x\n", p_conn_up->conn_latency);
            pf("sup_to       : 0x%04x\n", p_conn_up->sup_to);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_ADV_ON:
        {
            st_ble_gap_adv_set_evt_t * p_adv_on = (st_ble_gap_adv_set_evt_t *)p_data->p_param;
            pf("receive BLE_GAP_EVENT_ADV_ON result : 0x%04x, adv_hdl : 0x%04x\n", result, p_adv_on->adv_hdl);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_ADV_OFF:
        {
            st_ble_gap_adv_off_evt_t * p_adv_off = (st_ble_gap_adv_off_evt_t *)p_data->p_param;
            pf("receive BLE_GAP_EVENT_ADV_OFF result : 0x%04x, adv_hdl : 0x%04x\n", result, p_adv_off->adv_hdl);
            R_BLE_CLI_SetCmdComp();
        } break;


        case BLE_GAP_EVENT_PASSKEY_ENTRY_REQ:
        {
            pf("receive BLE_GAP_EVENT_PASSKEY_ENTRY_REQ\n");
            st_ble_gap_conn_hdl_evt_t * p_passkey_evt_param =
                (st_ble_gap_conn_hdl_evt_t *)p_data->p_param;

            gs_pairing_conn_hdl = p_passkey_evt_param->conn_hdl;
        } break;

