renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/cmd/r_ble_cmd_abs.c
        case BLE_GAP_EVENT_PASSKEY_DISPLAY_REQ:
        {
            pf("receive BLE_GAP_EVENT_PASSKEY_DISPLAY_REQ\n");
            st_ble_gap_passkey_display_evt_t * p_passkey_disp_evt_param =
                (st_ble_gap_passkey_display_evt_t *)p_data->p_param;
            pf("conn_hdl : 0%04x, passkey : %06d\n", 
                p_passkey_disp_evt_param->conn_hdl, p_passkey_disp_evt_param->passkey);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_NUM_COMP_REQ:
        {
            pf("receive BLE_GAP_EVENT_NUM_COMP_REQ\n");
            st_ble_gap_num_comp_evt_t * p_numcmp_evt_param =
                (st_ble_gap_num_comp_evt_t *)p_data->p_param;

            gs_pairing_conn_hdl = p_numcmp_evt_param->conn_hdl;
            pf("numeric : %06d\n", p_numcmp_evt_param->numeric);
        } break;

        case BLE_GAP_EVENT_PEER_KEY_INFO:
        {
            pf("receive BLE_GAP_EVENT_PEER_KEY_INFO\n");
            st_ble_gap_peer_key_info_evt_t * p_peer_key =
                (st_ble_gap_peer_key_info_evt_t *)p_data->p_param;

            pf("LTK : %02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x \n", 
                    p_peer_key->key_ex_param.p_keys_info->enc_info[0],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[1],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[2],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[3],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[4],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[5],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[6],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[7],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[8],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[9],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[10],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[11],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[12],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[13],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[14],
                    p_peer_key->key_ex_param.p_keys_info->enc_info[15]);

            if(0 != (p_peer_key->key_ex_param.keys & BLE_GAP_KEY_DIST_IDKEY))
            {
                pf("IRK : %02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x \n", 
                    p_peer_key->key_ex_param.p_keys_info->id_info[0],
                    p_peer_key->key_ex_param.p_keys_info->id_info[1],
                    p_peer_key->key_ex_param.p_keys_info->id_info[2],
                    p_peer_key->key_ex_param.p_keys_info->id_info[3],
                    p_peer_key->key_ex_param.p_keys_info->id_info[4],
                    p_peer_key->key_ex_param.p_keys_info->id_info[5],
                    p_peer_key->key_ex_param.p_keys_info->id_info[6],
                    p_peer_key->key_ex_param.p_keys_info->id_info[7],
                    p_peer_key->key_ex_param.p_keys_info->id_info[8],
                    p_peer_key->key_ex_param.p_keys_info->id_info[9],
                    p_peer_key->key_ex_param.p_keys_info->id_info[10],
                    p_peer_key->key_ex_param.p_keys_info->id_info[11],
                    p_peer_key->key_ex_param.p_keys_info->id_info[12],
                    p_peer_key->key_ex_param.p_keys_info->id_info[13],
                    p_peer_key->key_ex_param.p_keys_info->id_info[14],
                    p_peer_key->key_ex_param.p_keys_info->id_info[15]);
                
                st_ble_dev_addr_t remote;
                memcpy(remote.addr, &p_peer_key->key_ex_param.p_keys_info->id_addr_info[1], BLE_BD_ADDR_LEN);
                remote.type = p_peer_key->key_ex_param.p_keys_info->id_addr_info[0];
                pf("remote id addr : %s \n", BLE_BD_ADDR_STR(remote.addr, remote.type));
            }

            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_PAIRING_COMP:
        {
            pf("receive BLE_GAP_EVENT_PAIRING_COMP result : 0x%04x\n", result);
            st_ble_gap_pairing_info_evt_t * p_param;
            p_param = (st_ble_gap_pairing_info_evt_t *)p_data->p_param;
            pf("sec : 0x%02x, mode : 0x%02x,  bond : 0x%02x, key_size : 0x%02x\n", 
                p_param->auth_info.security, p_param->auth_info.pair_mode, 
                p_param->auth_info.bonding, p_param->auth_info.ekey_size);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_ENC_CHG:
        {
            pf("receive BLE_GAP_EVENT_ENC_CHG result : 0x%04x\n", result);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_SCAN_OFF:
        {
            pf("receive BLE_GAP_EVENT_SCAN_OFF result : 0x%04x\n", result);
#if (BLE_CFG_LIB_TYPE == 0) 
            if(3 == gs_sync_scan)
            {
                R_BLE_GAP_ConfWhiteList(BLE_GAP_LIST_REM_DEV, &gs_sync_advr, 1);
                R_BLE_GAP_ConfPerdAdvList(BLE_GAP_LIST_REM_DEV, &gs_sync_advr, &gs_adv_sid, 1);
            }
#endif /* (BLE_CFG_LIB_TYPE == 0)  */
        } break;

        case BLE_GAP_EVENT_WHITE_LIST_CONF_COMP:
        {
            pf("receive BLE_GAP_EVENT_WHITE_LIST_CONF_COMP result : 0x%04x\n", result);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_RSLV_LIST_CONF_COMP :
        {
            pf("receive BLE_GAP_EVENT_RSLV_LIST_CONF_COMP result : 0x%04x\n", result);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_PRIV_MODE_SET_COMP :
        {
            pf("receive BLE_GAP_EVENT_PRIV_MODE_SET_COMP result : 0x%04x\n", result);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_RPA_EN_COMP :
        {
            pf("receive BLE_GAP_EVENT_RPA_EN_COMP result : 0x%04x\n", result);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_RD_RPA_COMP :
        {
            st_ble_gap_rd_rpa_evt_t * p_param;
            p_param = (st_ble_gap_rd_rpa_evt_t *)p_data->p_param;
            pf("receive BLE_GAP_EVENT_RD_RPA_COMP result : 0x%04x\n", result);
            if(BLE_SUCCESS == result)
            {
                pf(" local rpa:%s \n", BLE_BD_ADDR_STR(p_param->addr.addr, p_param->addr.type));
                R_BLE_CLI_SetCmdComp();
            }
        } break;

#if (BLE_CFG_LIB_TYPE == 0) 
        case BLE_GAP_EVENT_PERD_ADV_ON:
        {
            pf("receive BLE_GAP_EVENT_PERD_ADV_ON result : 0x%04x\n", result);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_PERD_ADV_OFF:
        {
            pf("receive BLE_GAP_EVENT_PERD_ADV_OFF result : 0x%04x\n", result);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_CREATE_SYNC_COMP:
        {
            if(BLE_SUCCESS == result)
            {
                pf("sync req has been sent.\n");
                R_BLE_CLI_SetCmdComp();
            }
            else
            {
                pf("sync req has not been sent.\n");
                R_BLE_CLI_SetCmdComp();
            }
        } break;

        case BLE_GAP_EVENT_PERD_LIST_CONF_COMP:
        {
            pf("receive BLE_GAP_EVENT_PERD_LIST_CONF_COMP result : 0x%04x\n", result);
            R_BLE_CLI_SetCmdComp();
            if(2 == gs_sync_scan)
            {
                R_BLE_GAP_CreateSync(NULL, 0, 0x0000, 0x4000);
            }
        } break;

        case BLE_GAP_EVENT_SYNC_EST:
        {
            gs_sync_scan = 3;
            if(BLE_SUCCESS == result)
            {
                pf("sync established\n");

