renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/cmd/r_ble_cmd_abs.c
                uint16_t sync_hdl_1;
                uint16_t sync_hdl_2;
                st_ble_gap_sync_est_evt_t * p_sync_evt;
                p_sync_evt = (st_ble_gap_sync_est_evt_t *)p_data->p_param;
                pf("sync_hdl : 0x%04x \n", p_sync_evt->sync_hdl);
                sync_hdl_1 = (uint16_t)(gs_sync_hdl);
                sync_hdl_2 = (uint16_t)(gs_sync_hdl >> 16);
                if((0xFFFFFFFF == gs_sync_hdl) ||
                    ((0xFFFF == sync_hdl_1) && (p_sync_evt->sync_hdl != sync_hdl_2)))
                {
                    gs_sync_hdl &= 0xFFFF0000;
                    gs_sync_hdl |= (uint16_t)p_sync_evt->sync_hdl;
                }
                else
                {
                    if((0xFFFF == sync_hdl_2) && (p_sync_evt->sync_hdl != sync_hdl_1))
                    {
                        gs_sync_hdl &= 0x0000FFFF;
                        gs_sync_hdl |= (uint32_t)(p_sync_evt->sync_hdl << 16);
                    }
                }
            }
            else
            {
                pf("sync not established\n");
                gs_sync_scan = 0;
            }
            R_BLE_CLI_SetCmdComp();

        } break;

        case BLE_GAP_EVENT_SYNC_TERM:
        {
            pf("receive BLE_GAP_EVENT_SYNC_TERM result : 0x%04x \n", result);
            if(BLE_SUCCESS == result)
            {
                pf("sync terminated\n");
                delete_sync_hdl(p_data);
                if(1 == gs_sync_term)
                {
                    if(0xFFFF != (uint16_t)(gs_sync_hdl >> 16))
                    {
                        R_BLE_GAP_TerminateSync((uint16_t)(gs_sync_hdl >> 16));
                    }
                }
            }
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_SYNC_LOST:
        {
            pf("sync lost\n");
            delete_sync_hdl(p_data);
            R_BLE_CLI_SetCmdComp();
        } break;

        case BLE_GAP_EVENT_ADV_SET_REMOVE_COMP:
        {
            st_ble_gap_rem_adv_set_evt_t * p_adv_set = (st_ble_gap_rem_adv_set_evt_t *)p_data->p_param;
            pf("receive BLE_GAP_EVENT_ADV_SET_REMOVE_COMP result : 0x%04x, adv_hdl : 0x%04x\n", result, p_adv_set->adv_hdl);
            R_BLE_CLI_SetCmdComp();
        } break;
#endif /* (BLE_CFG_LIB_TYPE == 0)  */

        default:
            break;
    }
}

#else /* (BLE_CFG_CMD_LINE_EN == 1) && (BLE_CFG_HCI_MODE_EN == 0) */

void R_BLE_CMD_AbsGapCb(uint16_t type, ble_status_t result, st_ble_evt_data_t * p_data)
{
    (void)type;
    (void)result;
    (void)&p_data;
    return;
}

const st_ble_cli_cmd_t g_abs_cmd;

#endif /* (BLE_CFG_CMD_LINE_EN == 1) && (BLE_CFG_HCI_MODE_EN == 0) */
